Catalogs/СпискиТоп35Товаров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>СпискиТоп35Товаров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состав</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СпискиТоп35Товаров/Ext/ManagerModule.bsl
Процедура СформироватьОписаниеЭлемента(ТабДок, Ссылка) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.Текст = "ВЫБРАТЬ
		               |	СпискиТоп35ТоваровТовары.Номенклатура,
		               |	СпискиТоп35ТоваровТовары.Номенклатура.Наименование КАК Наименование,
		               |	СпискиТоп35ТоваровТовары.Состав КАК Состав,
		               |	СпискиТоп35ТоваровТовары.СрокГодности КАК СрокГодности,
		               |	СпискиТоп35ТоваровТовары.Описание КАК Описание
		               |ИЗ
		               |	Справочник.СпискиТоп35Товаров.Товары КАК СпискиТоп35ТоваровТовары
		               |ГДЕ
		               |	СпискиТоп35ТоваровТовары.Ссылка = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	СпискиТоп35ТоваровТовары.НомерСтроки";
					   
		Макет = Справочники.СпискиТоп35Товаров.ПолучитьМакет("МакетВыводаЭлемента");
		
		Область = Макет.ПолучитьОбласть("Шапка");
		Область.Параметры.ДатаНач = Формат(Ссылка.ДатаНачалаДействия, "ДФ=dd.MM.yyyy");
		Область.Параметры.ДатаКон = Формат(Ссылка.ДатаОкончанияДействия, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(Область);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("Строка");
			Область.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Область);
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры
